avrdudes/avr-libc/include/avr/ioavr32ea32.h
/*
--------------------------------------------------------------------------
DAC - Digital to Analog Converter
--------------------------------------------------------------------------
*/

/* Digital to Analog Converter */
typedef struct DAC_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t reserved_1[1];
    _WORDREGISTER(DATA);  /* DATA Register */
    register8_t reserved_2[12];
} DAC_t;

/* Output Buffer Range select bit group values */
typedef enum DAC_OUTRANGE_VALUES_enum
{
    DAC_OUTRANGE_AUTO_gv           = 0x00,  /* Output buffer automatically choose best range */
    DAC_OUTRANGE_LOW_gv            = 0x02,  /* Output buffer configured to low range */
    DAC_OUTRANGE_HIGH_gv           = 0x03   /* Output buffer configured to high range */
} DAC_OUTRANGE_values_t;

/* Output Buffer Range select bit group configurations*/
typedef enum DAC_OUTRANGE_enum
{
    DAC_OUTRANGE_AUTO_gc           = (DAC_OUTRANGE_AUTO_gv << DAC_OUTRANGE_gp),  /* Output buffer automatically choose best range */
    DAC_OUTRANGE_LOW_gc            = (DAC_OUTRANGE_LOW_gv << DAC_OUTRANGE_gp),  /* Output buffer configured to low range */
    DAC_OUTRANGE_HIGH_gc           = (DAC_OUTRANGE_HIGH_gv << DAC_OUTRANGE_gp)   /* Output buffer configured to high range */
} DAC_OUTRANGE_t;

/*
--------------------------------------------------------------------------
EVSYS - Event System
--------------------------------------------------------------------------
*/

/* Event System */
typedef struct EVSYS_struct
{
    register8_t SWEVENTA;  /* Software Event A */
    register8_t reserved_1[15];
    register8_t CHANNEL0;  /* Multiplexer Channel 0 */
    register8_t CHANNEL1;  /* Multiplexer Channel 1 */
    register8_t CHANNEL2;  /* Multiplexer Channel 2 */
    register8_t CHANNEL3;  /* Multiplexer Channel 3 */
    register8_t CHANNEL4;  /* Multiplexer Channel 4 */
    register8_t CHANNEL5;  /* Multiplexer Channel 5 */
    register8_t reserved_2[10];
    register8_t USERCCLLUT0A;  /* CCL0 Event A */
    register8_t USERCCLLUT0B;  /* CCL0 Event B */
    register8_t USERCCLLUT1A;  /* CCL1 Event A */
    register8_t USERCCLLUT1B;  /* CCL1 Event B */
    register8_t USERCCLLUT2A;  /* CCL2 Event A */
    register8_t USERCCLLUT2B;  /* CCL2 Event B */
    register8_t USERCCLLUT3A;  /* CCL3 Event A */
    register8_t USERCCLLUT3B;  /* CCL3 Event B */
    register8_t USERADC0START;  /* ADC0 */
    register8_t USEREVSYSEVOUTA;  /* EVOUTA */
    register8_t reserved_3[1];
    register8_t USEREVSYSEVOUTC;  /* EVOUTC */
    register8_t USEREVSYSEVOUTD;  /* EVOUTD */
    register8_t reserved_4[1];
    register8_t USEREVSYSEVOUTF;  /* EVOUTF */
    register8_t USERUSART0IRDA;  /* USART0 */
    register8_t USERUSART1IRDA;  /* USART1 */
    register8_t USERUSART2IRDA;  /* USART2 */
    register8_t USERTCA0CNTA;  /* TCA0 Event A */
    register8_t USERTCA0CNTB;  /* TCA0 Event B */
    register8_t USERTCA1CNTA;  /* TCA1 Event A */
    register8_t USERTCA1CNTB;  /* TCA1 Event B */
    register8_t USERTCB0CAPT;  /* TCB0 Event A */
    register8_t USERTCB0COUNT;  /* TCB0 Event B */
    register8_t USERTCB1CAPT;  /* TCB1 Event A */
    register8_t USERTCB1COUNT;  /* TCB1 Event B */
    register8_t USERTCB2CAPT;  /* TCB2 Event A */
    register8_t USERTCB2COUNT;  /* TCB2 Event B */
    register8_t USERTCB3CAPT;  /* TCB3 Event A */
    register8_t USERTCB3COUNT;  /* TCB3 Event B */
    register8_t reserved_5[2];
} EVSYS_t;

/* Channel generator select bit group values */
typedef enum EVSYS_CHANNEL_VALUES_enum
{
    EVSYS_CHANNEL_OFF_gv           = 0x00,  /* Off */
    EVSYS_CHANNEL_UPDI_SYNCH_gv    = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL_RTC_OVF_gv       = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL_RTC_CMP_gv       = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL_RTC_PITEV0_gv    = 0x08,  /* Periodic Interrupt Timer Event 0 */
    EVSYS_CHANNEL_RTC_PITEV1_gv    = 0x09,  /* Periodic Interrupt Timer Event 1 */
    EVSYS_CHANNEL_CCL_LUT0_gv      = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL_CCL_LUT1_gv      = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL_CCL_LUT2_gv      = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL_CCL_LUT3_gv      = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL_AC0_OUT_gv       = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL_AC1_OUT_gv       = 0x21,  /* Analog Comparator 1 out */
    EVSYS_CHANNEL_ADC0_RES_gv      = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL_ADC0_SAMP_gv     = 0x25,  /* ADC 0 Sample Ready */
    EVSYS_CHANNEL_ADC0_WCMP_gv     = 0x26,  /* ADC 0 Window Compare */
    EVSYS_CHANNEL_PORTA_EV0_gv     = 0x40,  /* Port A Event 0 */
    EVSYS_CHANNEL_PORTA_EV1_gv     = 0x41,  /* Port A Event 1 */
    EVSYS_CHANNEL_PORTC_EV0_gv     = 0x44,  /* Port C Event 0 */
    EVSYS_CHANNEL_PORTC_EV1_gv     = 0x45,  /* Port C Event 1 */
    EVSYS_CHANNEL_PORTD_EV0_gv     = 0x46,  /* Port D Event 0 */
    EVSYS_CHANNEL_PORTD_EV1_gv     = 0x47,  /* Port D Event 1 */
    EVSYS_CHANNEL_PORTF_EV0_gv     = 0x4A,  /* Port F Event 0 */
    EVSYS_CHANNEL_PORTF_EV1_gv     = 0x4B,  /* Port F Event 1 */
    EVSYS_CHANNEL_USART0_XCK_gv    = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL_USART1_XCK_gv    = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL_USART2_XCK_gv    = 0x62,  /* USART 2 XCK */
    EVSYS_CHANNEL_SPI0_SCK_gv      = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL_TCA0_HUNF_gv     = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL_TCA1_OVF_LUNF_gv = 0x88,  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL_TCA1_HUNF_gv     = 0x89,  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL_TCA1_CMP0_LCMP0_gv = 0x8C,  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL_TCA1_CMP1_LCMP1_gv = 0x8D,  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL_TCA1_CMP2_LCMP2_gv = 0x8E,  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL_TCB0_CAPT_gv     = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL_TCB0_OVF_gv      = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL_TCB1_CAPT_gv     = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL_TCB1_OVF_gv      = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL_TCB2_CAPT_gv     = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL_TCB2_OVF_gv      = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL_TCB3_CAPT_gv     = 0xA6,  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL_TCB3_OVF_gv      = 0xA7   /* Timer/Counter B3 overflow */
} EVSYS_CHANNEL_values_t;

